In [11]:
!pip3 install pandas --user

Collecting pandas
  Downloading pandas-1.4.2-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.7/11.7 MB 1.3 MB/s eta 0:00:00m eta 0:00:010:01:01m
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2021.1)
Collecting numpy>=1.18.5
  Downloading numpy-1.22.3-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 16.8/16.8 MB 677.3 kB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Requirement already satisfied: python-dateutil>=2.8.1 in /home/user/.local/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: numpy, pandas
Successfully installed numpy-1.22.3 pandas-1.4.2

In [12]:
import pandas as pd

In [13]:
data=[[1000,'Steve',86.29],
      [1001,'Mathew',91.63],
      [1002,'Jose',72.90],
      [1003,'Patty',69.23],
      [1004,'Vin',88.30]]

In [14]:
pd.DataFrame(data)

      0       1      2
0  1000   Steve  86.29
1  1001  Mathew  91.63
2  1002    Jose  72.90
3  1003   Patty  69.23
4  1004     Vin  88.30

In [15]:
pd.DataFrame(data,columns=['Regd.No','Name','Marks%'],index=[1,2,3,4,5])

   Regd.No    Name  Marks%
1     1000   Steve   86.29
2     1001  Mathew   91.63
3     1002    Jose   72.90
4     1003   Patty   69.23
5     1004     Vin   88.30

In [17]:
data={'Regd. No':[1000,1001,1002,1003,1004],
     'Names':['Steve','Mathew','Jose','Patty','Vin'],
     'Marks%':[86.29,91.63,72.90,69.23,88.30]}

In [18]:
pd.DataFrame(data)

   Regd. No   Names  Marks%
0      1000   Steve   86.29
1      1001  Mathew   91.63
2      1002    Jose   72.90
3      1003   Patty   69.23
4      1004     Vin   88.30